## Pandas -2

In [44]:
import pandas as pd 
import numpy as np

In [3]:
d = pd.Series({'a':100,'b':200,'c':300})
d

a    100
b    200
c    300
dtype: int64

In [4]:
d = pd.Series({'a':100,'b':200,'c':300},index=['a','e','s','c'])
d

a    100.0
e      NaN
s      NaN
c    300.0
dtype: float64

In [10]:
# DataFrame:- having multiple columns.
df = pd.DataFrame({'Name':['Suman','Surya','Asish','JD','Debasis'],'Roll_No':[72,74,10,84,88],'Course':['AIML','Python','java','Rust','c++']})
df

      Name  Roll_No  Course
0    Suman       72    AIML
1    Surya       74  Python
2    Asish       10    java
3       JD       84    Rust
4  Debasis       88     c++

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
# Accessing a specific column.
df.Course

0      AIML
1    Python
2      java
3      Rust
4       c++
Name: Course, dtype: object

In [15]:
# Accessing a specific element.
df.Course[3]

'Rust'

In [14]:
df.Name[0]

'Suman'

In [16]:
# head():- returns the first top 5 values of the dataframe.
df.head()

      Name  Roll_No  Course
0    Suman       72    AIML
1    Surya       74  Python
2    Asish       10    java
3       JD       84    Rust
4  Debasis       88     c++

In [22]:
# head():- returns the Specific values from top of the dataframe.
df.head(2)

    Name  Roll_No  Course
0  Suman       72    AIML
1  Surya       74  Python

In [20]:
# tail():- returns the last 5 values of the dataframe.
df.tail()

      Name  Roll_No  Course
0    Suman       72    AIML
1    Surya       74  Python
2    Asish       10    java
3       JD       84    Rust
4  Debasis       88     c++

In [23]:
# tail():- returns the Specific values from bottom of the dataframe.
df.tail(2)

      Name  Roll_No Course
3       JD       84   Rust
4  Debasis       88    c++

In [24]:
# Slicing of Dataframe:-
df[::,::]

InvalidIndexError: (slice(None, None, None), slice(None, None, None))

In [30]:
# iloc:-Index Location :-this helps to perform Slicing on dataframe.
df.iloc[::,::]

      Name  Roll_No  Course
0    Suman       72    AIML
1    Surya       74  Python
2    Asish       10    java
3       JD       84    Rust
4  Debasis       88     c++

In [29]:
df.iloc[::,::2]  #[row,columns]

      Name  Course
0    Suman    AIML
1    Surya  Python
2    Asish    java
3       JD    Rust
4  Debasis     c++

In [28]:
df.iloc[::2,::]

      Name  Roll_No Course
0    Suman       72   AIML
2    Asish       10   java
4  Debasis       88    c++

In [33]:
# returns only 2nd columns.
df.iloc[::,2]

0      AIML
1    Python
2      java
3      Rust
4       c++
Name: Course, dtype: object

In [32]:
df.iloc[2,::]

Name       Asish
Roll_No       10
Course      java
Name: 2, dtype: object

In [35]:
# Renaming a columns name:
df = df.rename(columns={'Name':'Student_Name'})
df

  Student_Name  Roll_No  Course
0        Suman       72    AIML
1        Surya       74  Python
2        Asish       10    java
3           JD       84    Rust
4      Debasis       88     c++

In [38]:
df

        Student_Name  Course
Roll_No
72             Suman    AIML
74             Surya  Python
10             Asish    java
84                JD    Rust
88           Debasis     c++

In [122]:
# Set index:-
df.set_index('Roll_No')
df

KeyError: "None of ['Roll_No'] are in the columns"

In [28]:
df =df.set_index('Roll_No',inplace=True)

NameError: name 'df' is not defined

In [33]:
df.Student_Name[0]

NameError: name 'df' is not defined

In [32]:
df.Student_Name[72]

NameError: name 'df' is not defined

In [30]:
dt = pd.DataFrame({'Name':['Suman','Surya','Asish','JD','Debasis'],'Roll_No':[72,74,10,84,88],'Course':['AIML','Python','java','Rust','c++']})
dt

      Name  Roll_No  Course
0    Suman       72    AIML
1    Surya       74  Python
2    Asish       10    java
3       JD       84    Rust
4  Debasis       88     c++

In [45]:
dt =dt.set_index('Roll_No')
dt

AttributeError: 'NoneType' object has no attribute 'set_index'

In [51]:
# Working with Null values:-
d1 = pd.DataFrame({'Day':[1,2,3,4,5,6,7],'Place':['A','B','C','D','E','F','G'],'Visits':[4,2,3,4,6,7,8]})
d1

   Day Place  Visits
0    1     A       4
1    2     B       2
2    3     C       3
3    4     D       4
4    5     E       6
5    6     F       7
6    7     G       8

In [53]:
d1

   Day Place  Visits
0    1     A       4
1    2     B       2
2    3     C       3
3    4     D       4
4    5     E       6
5    6     F       7
6    7     G       8

In [55]:
d1 = pd.DataFrame({'Day':[1,2,3,4,5,6,7],'Place':['A','B','C','D',np.nan,'F','G'],'Visits':[4,2,3,4,6,7,8]})
d1

   Day Place  Visits
0    1     A       4
1    2     B       2
2    3     C       3
3    4     D       4
4    5   NaN       6
5    6     F       7
6    7     G       8

In [57]:
# to check missing value
d1.isnull()

     Day  Place  Visits
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False   True   False
5  False  False   False
6  False  False   False

In [59]:
# to check missing values at time.
d1.isnull().sum()

Day       0
Place     1
Visits    0
dtype: int64

In [61]:
# to replace the null value.
d1.fillna('new')

   Day Place  Visits
0    1     A       4
1    2     B       2
2    3     C       3
3    4     D       4
4    5   new       6
5    6     F       7
6    7     G       8

In [62]:
d1

   Day Place  Visits
0    1     A       4
1    2     B       2
2    3     C       3
3    4     D       4
4    5   NaN       6
5    6     F       7
6    7     G       8

In [63]:
# to replace the null value permanently
d1.fillna('new',inplace=True)
d1

   Day Place  Visits
0    1     A       4
1    2     B       2
2    3     C       3
3    4     D       4
4    5   new       6
5    6     F       7
6    7     G       8

In [65]:
d1.isnull().sum()

Day       0
Place     0
Visits    0
dtype: int64

In [88]:
d2 = pd.DataFrame({'Day':[1,2,3,4,5,6,7],'Places':['A','B',np.nan,np.nan,'E','F','G'],'Visits':[4,2,3,4,6,7,8]})

In [89]:
d2

   Day Places  Visits
0    1      A       4
1    2      B       2
2    3    NaN       3
3    4    NaN       4
4    5      E       6
5    6      F       7
6    7      G       8

In [90]:
d2.isnull().sum()

Day       0
Places    2
Visits    0
dtype: int64

In [91]:
d2.fillna('new1',inplace=True)
d2

   Day Places  Visits
0    1      A       4
1    2      B       2
2    3   new1       3
3    4   new1       4
4    5      E       6
5    6      F       7
6    7      G       8

In [92]:
# return the datatype of every columns in dataframe.
d2.type()

AttributeError: 'DataFrame' object has no attribute 'type'

In [93]:
# retuns all the information of our dataframe.
d2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Day     7 non-null      int64
 1   Places  7 non-null      object
 2   Visits  7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

In [96]:
# to find the unique values.
d2.Places.unique()

array(['A', 'B', 'new1', 'E', 'F', 'G'], dtype=object)

In [97]:
d2.Day.unique()

array([1, 2, 3, 4, 5, 6, 7])

In [99]:
d2.Day.mean()

np.float64(4.0)

In [100]:
d2.Day.max()

np.int64(7)

In [102]:
d2.Day.min()

np.int64(1)

In [105]:
d2.Visits.min()

np.int64(2)

In [107]:
# to find all the statistical values of our dataframe.
# describe(): returns statistical values of only integer values. 
d2.describe()

            Day    Visits
count  7.000000  7.000000
mean   4.000000  4.857143
std    2.160247  2.193063
min    1.000000  2.000000
25%    2.500000  3.500000
50%    4.000000  4.000000
75%    5.500000  6.500000
max    7.000000  8.000000

In [111]:
# retuns the stattistical values of only object col
d2.describe(include='O')

       Places
count       7
unique      6
top      new1
freq        2

In [113]:
# retuns the stattistical values of all the columns in our dataframes.
d2.describe(include='all')

             Day Places    Visits
count   7.000000      7  7.000000
unique       NaN      6       NaN
top          NaN   new1       NaN
freq         NaN      2       NaN
mean    4.000000    NaN  4.857143
std     2.160247    NaN  2.193063
min     1.000000    NaN  2.000000
25%     2.500000    NaN  3.500000
50%     4.000000    NaN  4.000000
75%     5.500000    NaN  6.500000
max     7.000000    NaN  8.000000

## Working with Datasets:-

In [115]:
import numpy as np
import pandas as pd

In [124]:
# to read the dataset.
df1 = pd.read_csv(r"C:\Users\suman\OneDrive\Documents\Desktop\AIML-CTTC-ALL-NOTES\iris\iris.data")
df1

     5.1  3.5  1.4  0.2     Iris-setosa
0    4.9  3.0  1.4  0.2     Iris-setosa
1    4.7  3.2  1.3  0.2     Iris-setosa
2    4.6  3.1  1.5  0.2     Iris-setosa
3    5.0  3.6  1.4  0.2     Iris-setosa
4    5.4  3.9  1.7  0.4     Iris-setosa
..   ...  ...  ...  ...             ...
144  6.7  3.0  5.2  2.3  Iris-virginica
145  6.3  2.5  5.0  1.9  Iris-virginica
146  6.5  3.0  5.2  2.0  Iris-virginica
147  6.2  3.4  5.4  2.3  Iris-virginica
148  5.9  3.0  5.1  1.8  Iris-virginica

[149 rows x 5 columns]

In [127]:
# df1.describe(include='all')

In [128]:
df1 = pd.read_csv(r"C:\Users\suman\OneDrive\Documents\Desktop\AIML-CTTC-ALL-NOTES\iris\iris.data",header=None)
df1

       0    1    2    3               4
0    5.1  3.5  1.4  0.2     Iris-setosa
1    4.9  3.0  1.4  0.2     Iris-setosa
2    4.7  3.2  1.3  0.2     Iris-setosa
3    4.6  3.1  1.5  0.2     Iris-setosa
4    5.0  3.6  1.4  0.2     Iris-setosa
..   ...  ...  ...  ...             ...
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

[150 rows x 5 columns]